{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "signature": {"inputs": {"supply": {"name": "supply:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}, {"size": "15"}]}}, "player_rates": {"name": "player_rates:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_7/dense_8/Gelu/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_7/dense_8/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_6/dense_7/Gelu/mul_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_6/dense_7/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_5/dense_6/Gelu/mul_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_5/dense_6/Gelu/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_7/attention_7/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_7/layer_normalization_7/Reshape/shape/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_7/layer_normalization_7/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_7/layer_normalization_7/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_7/layer_normalization_7/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_7/layer_normalization_7/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_7/layer_normalization_7/ones/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_7/layer_normalization_7/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_7/layer_normalization_7/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_7/layer_normalization_7/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_7/layer_normalization_7/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_7/layer_normalization_7/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_7/layer_normalization_7/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_7/layer_normalization_7/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_7/layer_normalization_7/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_7/layer_normalization_7/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_6/attention_6/mul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_6/layer_normalization_6/Reshape/shape/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_6/layer_normalization_6/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_6/layer_normalization_6/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_6/layer_normalization_6/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_6/layer_normalization_6/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_6/layer_normalization_6/ones/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_6/layer_normalization_6/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_6/layer_normalization_6/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_6/layer_normalization_6/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_6/layer_normalization_6/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_6/layer_normalization_6/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_6/layer_normalization_6/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_6/layer_normalization_6/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_6/layer_normalization_6/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_6/layer_normalization_6/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/attention_5/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Reshape/shape/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/ones/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/attention_4/mul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Reshape/shape/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/ones/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "477"}, {"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_STRING"}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/card_embedding/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/Gelu/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/batch_normalization_4/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/batch_normalization_4/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/Gelu/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Cast_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Cast_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_6/layer_normalization_6/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_6/layer_normalization_6/Cast_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_7/layer_normalization_7/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_7/layer_normalization_7/Cast_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/global_average_pooling1d_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_5/batch_normalization_5/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_5/batch_normalization_5/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_5/dense_6/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_5/dense_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_1/my_dense_5/dense_6/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_6/batch_normalization_6/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_6/dense_7/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "200"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_6/dense_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_1/my_dense_6/dense_7/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_7/batch_normalization_7/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_7/dense_8/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "100"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_7/dense_8/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_1/my_dense_7/dense_8/Gelu/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/dense_9/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/dense_9/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}}}, {"name": "player_rates", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, {"name": "supply", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "15"}]}}, "dtype": {"type": "DT_STRING"}}}, {"name": "unknown", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/batch_normalization_4/batchnorm/mul_1", "op": "Mul", "input": ["player_rates", "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/batch_normalization_4/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/string_lookup/Equal", "op": "Equal", "input": ["supply", "unknown_1"], "attr": {"incompatible_shape_error": {"b": true}, "T": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/string_lookup/None_Lookup/LookupTableFindV2", "op": "LookupTableFindV2", "input": ["unknown", "supply", "unknown_0"], "attr": {"Tin": {"type": "DT_STRING"}, "Tout": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/batch_normalization_4/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/batch_normalization_4/batchnorm/mul_1", "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/batch_normalization_4/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/string_lookup/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/string_lookup/Equal", "unknown_2", "StatefulPartitionedCall/end_turn_predictor3_1/string_lookup/None_Lookup/LookupTableFindV2"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/batch_normalization_4/batchnorm/add_1", "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/MatMul/ReadVariableOp", "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/card_embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown_3", "StatefulPartitionedCall/end_turn_predictor3_1/string_lookup/SelectV2", "StatefulPartitionedCall/end_turn_predictor3_1/card_embedding/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT64"}, "Tindices": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/Gelu/mul/x", "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/BiasAdd", "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/Gelu/add/x", "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/Gelu/mul", "StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/Gelu/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_dense_4/dense_5/Gelu/mul_1", "StatefulPartitionedCall/end_turn_predictor3_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/card_embedding/embedding_lookup", "StatefulPartitionedCall/end_turn_predictor3_1/ExpandDims", "StatefulPartitionedCall/end_turn_predictor3_1/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Shape", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice_2/stack", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice_2/stack_1", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice_2/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Shape", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice/stack", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice/stack_1", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Shape", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice_1/stack", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice_1/stack_1", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice_1/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Reshape/shape/0", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/mul_1", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/strided_slice_2", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Reshape/shape/3"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/ones/packed_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/mul_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/zeros/packed_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/mul_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/concat", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/ones/packed", "op": "ExpandDims", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/mul_1", "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/ones/packed_const_axis"], "attr": {"T": {"type": "DT_INT32"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/zeros/packed", "op": "ExpandDims", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/mul_1", "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/zeros/packed_const_axis"], "attr": {"T": {"type": "DT_INT32"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/ones", "op": "Fill", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/ones/packed", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/ones/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/zeros/packed", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/FusedBatchNormV3", "op": "FusedBatchNormV3", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Reshape", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/ones", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/zeros", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Const", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Const_1"], "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.001}, "exponential_avg_factor": {"f": 1.0}, "U": {"type": "DT_FLOAT"}, "data_format": {"s": "TkNIVw=="}, "is_training": {"b": true}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/FusedBatchNormV3", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/mul_3", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Reshape_1", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Cast/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/add", "op": "AddV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/mul_3", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/Cast_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/attention_4/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/add", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/add"], "attr": {"adj_y": {"b": true}, "T": {"type": "DT_FLOAT"}, "adj_x": {"b": false}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/attention_4/mul", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/attention_4/MatMul", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/attention_4/mul/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/attention_4/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/attention_4/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/attention_4/MatMul_1", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/attention_4/Softmax", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/layer_normalization_4/add"], "attr": {"adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_x": {"b": false}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/add", "op": "AddV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/concat", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/attention_4/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/add"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Shape", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice_2/stack", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice_2/stack_1", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice_2/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Shape", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice/stack", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice/stack_1", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Shape", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice_1/stack", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice_1/stack_1", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Reshape/shape/0", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/mul_1", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/strided_slice_2", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Reshape/shape/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/ones/packed_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/mul_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/zeros/packed_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/mul_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_4/add", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/ones/packed", "op": "ExpandDims", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/mul_1", "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/ones/packed_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/zeros/packed", "op": "ExpandDims", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/mul_1", "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/zeros/packed_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/ones", "op": "Fill", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/ones/packed", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/ones/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/zeros/packed", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/FusedBatchNormV3", "op": "FusedBatchNormV3", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Reshape", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/ones", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/zeros", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Const", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Const_1"], "attr": {"data_format": {"s": "TkNIVw=="}, "T": {"type": "DT_FLOAT"}, "is_training": {"b": true}, "epsilon": {"f": 0.001}, "exponential_avg_factor": {"f": 1.0}, "U": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/FusedBatchNormV3", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/mul_3", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Reshape_1", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Cast/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/add", "op": "AddV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/mul_3", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/Cast_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/attention_5/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/add", "StatefulPartitionedCall/end_turn_predictor3_1/my_attention_5/layer_normalization_5/add"], "attr": {"adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": true}}}, {"name": 