{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "signature": {"inputs": {"player_rates": {"name": "player_rates:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "supply": {"name": "supply:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "15"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_23/dense_28/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_23/dense_28/Gelu/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_22/dense_27/Gelu/mul_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_22/dense_27/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_21/dense_26/Gelu/mul_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_21/dense_26/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_23/attention_23/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_23/layer_normalization_23/Reshape/shape/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_23/layer_normalization_23/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_23/layer_normalization_23/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_23/layer_normalization_23/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_23/layer_normalization_23/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_23/layer_normalization_23/ones/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_23/layer_normalization_23/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_23/layer_normalization_23/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_23/layer_normalization_23/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_23/layer_normalization_23/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_23/layer_normalization_23/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_23/layer_normalization_23/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_23/layer_normalization_23/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_23/layer_normalization_23/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_23/layer_normalization_23/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_22/attention_22/mul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_22/layer_normalization_22/Reshape/shape/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_22/layer_normalization_22/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_22/layer_normalization_22/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_22/layer_normalization_22/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_22/layer_normalization_22/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_22/layer_normalization_22/ones/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_22/layer_normalization_22/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_22/layer_normalization_22/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_22/layer_normalization_22/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_22/layer_normalization_22/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_22/layer_normalization_22/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_22/layer_normalization_22/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_22/layer_normalization_22/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_22/layer_normalization_22/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_22/layer_normalization_22/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/attention_21/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Reshape/shape/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Reshape/shape/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/ones/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/attention_20/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Reshape/shape/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/ones/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "475"}, {"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/card_embedding/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/Gelu/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/batch_normalization_20/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/batch_normalization_20/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/Gelu/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Cast_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Cast_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_22/layer_normalization_22/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_22/layer_normalization_22/Cast_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_23/layer_normalization_23/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_23/layer_normalization_23/Cast_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/global_average_pooling1d_5/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_21/batch_normalization_21/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_21/batch_normalization_21/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_21/dense_26/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}, {"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_21/dense_26/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_5/my_dense_21/dense_26/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_22/batch_normalization_22/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_22/dense_27/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "200"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_22/dense_27/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_5/my_dense_22/dense_27/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_23/batch_normalization_23/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_23/dense_28/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_23/dense_28/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_5/my_dense_23/dense_28/Gelu/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/dense_29/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/dense_29/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "player_rates", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "supply", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT32"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "15"}]}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/batch_normalization_20/batchnorm/mul_1", "op": "Mul", "input": ["player_rates", "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/batch_normalization_20/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/card_embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown", "supply", "StatefulPartitionedCall/end_turn_predictor3_5/card_embedding/embedding_lookup/axis"], "attr": {"batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/batch_normalization_20/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/batch_normalization_20/batchnorm/mul_1", "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/batch_normalization_20/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/batch_normalization_20/batchnorm/add_1", "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/MatMul/ReadVariableOp", "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/Gelu/mul/x", "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/BiasAdd"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/BiasAdd", "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/Gelu/add/x", "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/Gelu/mul", "StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/Gelu/add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_dense_20/dense_25/Gelu/mul_1", "StatefulPartitionedCall/end_turn_predictor3_5/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/card_embedding/embedding_lookup", "StatefulPartitionedCall/end_turn_predictor3_5/ExpandDims", "StatefulPartitionedCall/end_turn_predictor3_5/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/concat"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Shape", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice_2/stack", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice_2/stack_1", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice_2/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Shape", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice/stack", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice/stack_1", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Shape", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice_1/stack", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice_1/stack_1", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice_1/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Reshape/shape/0", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/mul_1", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/strided_slice_2", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Reshape/shape/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/ones/packed_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/mul_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/zeros/packed_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/mul_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/concat", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/ones/packed", "op": "ExpandDims", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/mul_1", "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/ones/packed_const_axis"], "attr": {"T": {"type": "DT_INT32"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/zeros/packed", "op": "ExpandDims", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/mul_1", "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/zeros/packed_const_axis"], "attr": {"T": {"type": "DT_INT32"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/ones", "op": "Fill", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/ones/packed", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/ones/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/zeros/packed", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/FusedBatchNormV3", "op": "FusedBatchNormV3", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Reshape", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/ones", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/zeros", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Const", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Const_1"], "attr": {"data_format": {"s": "TkNIVw=="}, "U": {"type": "DT_FLOAT"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.001}, "is_training": {"b": true}, "exponential_avg_factor": {"f": 1.0}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/FusedBatchNormV3", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/mul_3", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Reshape_1", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Cast/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/add", "op": "AddV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/mul_3", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/Cast_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/attention_20/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/add", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/add"], "attr": {"adj_y": {"b": true}, "T": {"type": "DT_FLOAT"}, "adj_x": {"b": false}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/attention_20/mul", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/attention_20/MatMul", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/attention_20/mul/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/attention_20/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/attention_20/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/attention_20/MatMul_1", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/attention_20/Softmax", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/layer_normalization_20/add"], "attr": {"adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/add", "op": "AddV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/concat", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/attention_20/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/add"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Shape", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice_2/stack", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice_2/stack_1", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Shape", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice/stack", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice/stack_1", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Shape", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice_1/stack", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice_1/stack_1", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice_1/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Reshape/shape/0", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/mul_1", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/strided_slice_2", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Reshape/shape/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/ones/packed_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/mul_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/zeros/packed_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/mul_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_20/add", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/ones/packed", "op": "ExpandDims", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/mul_1", "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/ones/packed_const_axis"], "attr": {"T": {"type": "DT_INT32"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/zeros/packed", "op": "ExpandDims", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/mul_1", "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/zeros/packed_const_axis"], "attr": {"T": {"type": "DT_INT32"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/ones", "op": "Fill", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/ones/packed", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/ones/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/zeros/packed", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/FusedBatchNormV3", "op": "FusedBatchNormV3", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Reshape", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/ones", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/zeros", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Const", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Const_1"], "attr": {"epsilon": {"f": 0.001}, "U": {"type": "DT_FLOAT"}, "data_format": {"s": "TkNIVw=="}, "is_training": {"b": true}, "exponential_avg_factor": {"f": 1.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/FusedBatchNormV3", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/mul_3", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Reshape_1", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Cast/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/add", "op": "AddV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/mul_3", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/Cast_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/attention_21/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/add", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/add"], "attr": {"T": {"type": "DT_FLOAT"}, "adj_y": {"b": true}, "adj_x": {"b": false}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/attention_21/mul", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/attention_21/MatMul", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/attention_21/mul/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/attention_21/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/attention_21/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/attention_21/MatMul_1", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/attention_21/Softmax", "StatefulPartitionedCall/end_turn_predictor3_5/my_attention_21/layer_normalization_21/add"], "attr": {"T": 