{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "signature": {"inputs": {"player_rates": {"name": "player_rates:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "supply": {"name": "supply:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "15"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_31/dense_38/Gelu/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_31/dense_38/Gelu/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_30/dense_37/Gelu/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_30/dense_37/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_29/dense_36/Gelu/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_29/dense_36/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_31/attention_31/mul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_31/layer_normalization_31/Reshape/shape/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_31/layer_normalization_31/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_31/layer_normalization_31/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_31/layer_normalization_31/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_31/layer_normalization_31/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_31/layer_normalization_31/ones/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_31/layer_normalization_31/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_31/layer_normalization_31/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_31/layer_normalization_31/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_31/layer_normalization_31/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_31/layer_normalization_31/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_31/layer_normalization_31/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_31/layer_normalization_31/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_31/layer_normalization_31/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_31/layer_normalization_31/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/attention_30/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/Reshape/shape/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/ones/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/attention_29/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Reshape/shape/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Reshape/shape/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/ones/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/attention_28/mul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Reshape/shape/0", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Reshape/shape/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/ones/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "475"}, {"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/card_embedding/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/Gelu/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/Gelu/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Cast_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Cast_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/Cast_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_31/layer_normalization_31/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_31/layer_normalization_31/Cast_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/global_average_pooling1d_7/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_29/dense_36/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_29/dense_36/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_7/my_dense_29/dense_36/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_30/dense_37/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "200"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_30/dense_37/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_7/my_dense_30/dense_37/Gelu/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_31/dense_38/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_31/dense_38/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_7/my_dense_31/dense_38/Gelu/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/dense_39/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/dense_39/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "player_rates", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "supply", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "15"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/BiasAdd", "op": "_FusedMatMul", "input": ["player_rates", "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/MatMul/ReadVariableOp", "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/card_embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown", "supply", "StatefulPartitionedCall/end_turn_predictor3_7/card_embedding/embedding_lookup/axis"], "attr": {"batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/Gelu/mul/x", "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/BiasAdd", "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/Gelu/add/x", "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/Gelu/mul", "StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/Gelu/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_dense_28/dense_35/Gelu/mul_1", "StatefulPartitionedCall/end_turn_predictor3_7/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/card_embedding/embedding_lookup", "StatefulPartitionedCall/end_turn_predictor3_7/ExpandDims", "StatefulPartitionedCall/end_turn_predictor3_7/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/concat"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Shape", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice_2/stack", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice_2/stack_1", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Shape", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice/stack", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice/stack_1", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Shape", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice_1/stack", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice_1/stack_1", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice_1/stack_2"], "attr": {"end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Reshape/shape/0", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/mul_1", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/strided_slice_2", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Reshape/shape/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/ones/packed_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/mul_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/zeros/packed_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/mul_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/concat", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/ones/packed", "op": "ExpandDims", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/mul_1", "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/ones/packed_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/zeros/packed", "op": "ExpandDims", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/mul_1", "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/zeros/packed_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/ones", "op": "Fill", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/ones/packed", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/ones/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/zeros/packed", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/FusedBatchNormV3", "op": "FusedBatchNormV3", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Reshape", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/ones", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/zeros", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Const", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Const_1"], "attr": {"is_training": {"b": true}, "exponential_avg_factor": {"f": 1.0}, "data_format": {"s": "TkNIVw=="}, "U": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.001}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/FusedBatchNormV3", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/mul_3", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Reshape_1", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Cast/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/add", "op": "AddV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/mul_3", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/Cast_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/attention_28/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/add", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/add"], "attr": {"adj_y": {"b": true}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/attention_28/mul", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/attention_28/MatMul", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/attention_28/mul/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/attention_28/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/attention_28/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/attention_28/MatMul_1", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/attention_28/Softmax", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/layer_normalization_28/add"], "attr": {"adj_x": {"b": false}, "adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/add", "op": "AddV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/concat", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/attention_28/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/add"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Shape", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice_2/stack", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice_2/stack_1", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice_2/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Shape", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice/stack", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice/stack_1", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Shape", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice_1/stack", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice_1/stack_1", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Reshape/shape/0", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/mul_1", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/strided_slice_2", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Reshape/shape/3"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/ones/packed_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/mul_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/zeros/packed_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/mul_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/add", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/ones/packed", "op": "ExpandDims", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/mul_1", "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/ones/packed_const_axis"], "attr": {"T": {"type": "DT_INT32"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/zeros/packed", "op": "ExpandDims", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/mul_1", "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/zeros/packed_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/ones", "op": "Fill", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/ones/packed", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/ones/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/zeros/packed", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/FusedBatchNormV3", "op": "FusedBatchNormV3", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Reshape", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/ones", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/zeros", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Const", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Const_1"], "attr": {"T": {"type": "DT_FLOAT"}, "is_training": {"b": true}, "epsilon": {"f": 0.001}, "exponential_avg_factor": {"f": 1.0}, "U": {"type": "DT_FLOAT"}, "data_format": {"s": "TkNIVw=="}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/FusedBatchNormV3", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/mul_3", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Reshape_1", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Cast/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/add", "op": "AddV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/mul_3", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/Cast_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/attention_29/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/add", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/add"], "attr": {"adj_x": {"b": false}, "adj_y": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/attention_29/mul", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/attention_29/MatMul", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/attention_29/mul/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/attention_29/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/attention_29/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/attention_29/MatMul_1", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/attention_29/Softmax", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/layer_normalization_29/add"], "attr": {"adj_x": {"b": false}, "adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/add", "op": "AddV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_28/add", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/attention_29/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_29/add"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/Shape", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/strided_slice_2/stack", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/strided_slice_2/stack_1", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/strided_slice_2/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/Shape", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/strided_slice/stack", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/strided_slice/stack_1", "StatefulPartitionedCall/end_turn_predictor3_7/my_attention_30/layer_normalization_30/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": 