{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "signature": {"inputs": {"player_rates": {"name": "player_rates:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "supply": {"name": "supply:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "15"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/Gelu/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "475"}, {"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/card_embedding/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/Gelu/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/Gelu/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/Gelu/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/global_average_pooling1d_10/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "200"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/Gelu/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "100"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/dense_54/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "6"}]}}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/dense_54/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "player_rates", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "supply", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT32"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "15"}]}}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/BiasAdd", "op": "_FusedMatMul", "input": ["player_rates", "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/MatMul/ReadVariableOp", "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/card_embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown", "supply", "StatefulPartitionedCall/end_turn_predictor3_10/card_embedding/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/Gelu/mul/x", "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/BiasAdd", "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/Gelu/add/x", "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/Gelu/mul", "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/Gelu/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/Gelu/mul_1", "StatefulPartitionedCall/end_turn_predictor3_10/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/card_embedding/embedding_lookup", "StatefulPartitionedCall/end_turn_predictor3_10/ExpandDims", "StatefulPartitionedCall/end_turn_predictor3_10/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/global_average_pooling1d_10/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/concat", "StatefulPartitionedCall/end_turn_predictor3_10/global_average_pooling1d_10/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/global_average_pooling1d_10/Mean", "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/MatMul/ReadVariableOp", "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/Gelu/mul/x", "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/BiasAdd", "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/Gelu/add/x", "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/Gelu/mul", "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/Gelu/add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/Gelu/mul_1", "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/MatMul/ReadVariableOp", "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/Gelu/mul/x", "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/BiasAdd", "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/Gelu/add/x", "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/Gelu/mul", "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/Gelu/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/Gelu/mul_1", "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/MatMul/ReadVariableOp", "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/Gelu/mul/x", "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/BiasAdd", "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/Gelu/add/x", "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/Gelu/mul", "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/Gelu/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/dense_54/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/Gelu/mul_1", "StatefulPartitionedCall/end_turn_predictor3_10/dense_54/MatMul/ReadVariableOp", "StatefulPartitionedCall/end_turn_predictor3_10/dense_54/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/dense_54/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/dense_54/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/end_turn_predictor3_10/dense_54/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 898}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/Gelu/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/Gelu/add/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/Gelu/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/Gelu/add/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/Gelu/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/Gelu/add/x", "shape": [], "dtype": "float32"}, {"name": "unknown", "shape": [475, 50], "dtype": "float32"}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/card_embedding/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/Gelu/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/Gelu/add/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/MatMul/ReadVariableOp", "shape": [2, 50], "dtype": "float32"}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/BiasAdd/ReadVariableOp", "shape": [50], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_10/my_dense_40/dense_50/Gelu/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/global_average_pooling1d_10/Mean/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/MatMul/ReadVariableOp", "shape": [50, 400], "dtype": "float32"}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/BiasAdd/ReadVariableOp", "shape": [400], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_10/my_dense_41/dense_51/Gelu/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/MatMul/ReadVariableOp", "shape": [400, 200], "dtype": "float32"}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/BiasAdd/ReadVariableOp", "shape": [200], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_10/my_dense_42/dense_52/Gelu/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/MatMul/ReadVariableOp", "shape": [200, 100], "dtype": "float32"}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/BiasAdd/ReadVariableOp", "shape": [100], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/end_turn_predictor3_10/my_dense_43/dense_53/Gelu/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/dense_54/MatMul/ReadVariableOp", "shape": [100, 6], "dtype": "float32"}, {"name": "StatefulPartitionedCall/end_turn_predictor3_10/dense_54/BiasAdd/ReadVariableOp", "shape": [6], "dtype": "float32"}]}]}